[
    {
        "en": "There was a map named 'Train Station,' which was created in 2010 but was released before the New Year celebrations in 2012. After the release, a bug had been noticed; the prop of the tower could be shot through with Shaft. Two days later, the use of this bug became punishable and a week after that, the bug had been completely fixed."
    },
    {
        "en": "In 2011, Developers decided to make a contest in which it was necessary to turn the turret constantly. A special map called Carousel was developed for this contest. It was assumed that players would not be able to use the supplies on that map (neither purchased, nor bonus boxes). The map was never released. It is worth noting that the main designer of this map was the legendary mapmaker Figishe, who created a lot of maps. Now the map is considered to be lost."
    },
    {
        "en": "The project of Ricochet turret first appeared in 2009. The turret was planned to be called 'Vulcan'. Its shots originally did not bounce off surfaces and were blue. At that time, Vulcan / Ricochet was a machine gun, but then the idea of bouncing balls appeared, and that idea later grew into a full-fledged turret, now known as Ricochet."
    },
    {
        "en": "When Hornet was just in the testing stage, it consisted of five parts: the central part and four side parts, each of which was below the level of the central unit, and on each side blocks there were tracks. Then Hornet changed to its present state because its design was deemed 'too futuristic' and the complexities associated with gravity and traction."
    },
    {
        "en": "Appearance of Shaft in June 2011 caused quite a furore among tankers. After the release, Shaft was bought at a rate of three pieces per second! Straight after that it was changed and paints with protection from Shaft were released. On the next day it was removed from players Garages, the crystals were given back and the description was changed. Shaft was weak, so it was slightly improved and, before the release, there was an open testing in Test Server. On the first day of testing, the maximum damage of Shaft in aiming mode was 150 - 175 - 200 - 250 HP (for M0 - M1 - M2 - M3), on the second day was 200 - 225 - 275 - 300."
    },
    {
        "en": "First Gold Box was worth 1 000 crystals. Initially, no one knew how, where and when this bonus would appear. First Gold Box fell on the map 'Kungur' when the battle fund was 700 crystals, it was caught by player Noosya. Later, Gold Boxes began to fall almost on every map, but their value was cut to 100 crystals. Now, the drop zones of the Gold Box drop exist on all maps and the value has again been increased to 1000 crystals."
    },
    {
        "en": "In February 2011, a special modification of Smoky was introduced. It was named Smoky XT. This modification costed about 4000 crystals. It was available for purchase only for one week. Smoky XT was better than Smoky M3 in all aspects."
    },
    {
        "en": "In 2009, developers decided to create a turret that could deal damage to opponents and heal allies. So Isida appeared. The first concept of Isida could only heal and looked like it had three teeth, something that resembles a model from the Game «Half-Life». Isida was also able to heal itself (by firing into the void). This ability was too strong and was removed. Isida was last modified in February 2017, when the self-healing ability was removed."
    },
    {
        "en": "During beta testing (May 2009) Tanki Online was awarded at Game Developers Conference in the category 'Best Game without a publisher'. This says that, while only in the test phase, Tanki Online had gained recognition and fame in the gaming industry."
    },
    {
        "en": "In the Summer of 2012, there was a special event hosted to holding the European Football Championship. During this action Gold Boxes value was increased several times. After the action finished it was estimated that during the action players caught 90 million crystals in gold boxes - in the current economic system it is worth nearly one billion crystals!"
    },
    {
        "en": "On September 27, 2012, an extraordinary battle called «Kasim vs Sun» took place — the Community Manager of Russian community, Maksim Khusainov, and Tech Support specialist, Kseniya Ignatyeva, fought against each other on Wasp + Smoky combination. Maksim won with a score of 22:19. Tankers could support Maksim and Kseniya by acquiring a special paint in the Garage that costed 100 crystals. 47 341 paints for Kasim were bought, 18 004 for Sun and 4 844 for both players — all those who bought the paint for Maksim received 59 crystals."
    },
    {
        "en": "Every year on October 31 Tanki celebrates Halloween. In 2012, during the action a special map was created 59 597 times, and a special gold box fell 12,008 times. There were some interesting coincidences: October 30, 2012 the 16666666th tanker registered, and the Tweet made about the special video blog was 666th. In 2014, there were 45 ghosts on a special Halloween map. On October 31st 2015, tankers spent in the game a total of 196 years, and caught 440 000 Gold boxes. The winner of the competition for the best gold catchers was the player Ti-To, who caught 195 boxes and received Viking XT and Thunder XT as an award."
    },
    {
        "en": "The creation of the first test version of Tanki took four and a half months. First registered player who is not a developer was GlebNikitin. And the first registered account was arts80 which belongs to server programmer Alex Kviring. The first map in the game was the prototype of Tribute."
    },
    {
        "en": "By mid-2010, there were about 200 000 players registered. On December 19, 2010 the millionth registration was achieved. 6 June 2011 - registration number 3 000 000 (the player with the nickname katyana). January 4, 2012 - seven millionth registration (the player with the nickname stepan1234567891). March 25, 2012 - the barrier of 10 million registrations was overcome (player with the nickname lYonsl). On Tanker Day 2012 there was a registration #15 000 000 (a player with the nickname adilov.amir). February 5, 2013 - twenty millionth registration (the player with the nickname tolik755). End of July of 2013 - thirty millionth registration (the player with the nickname nadja8201)."
    },
    {
        "en": "Tanki Online is most popular in Russia. This is followed by Ukraine, Belarus, Armenia, Kazakhstan, Germany, Moldova, Georgia, the United States and Saudi Arabia."
    },
    {
        "en": "The most popular paint in the game is 'Green', then 'Holiday' and 'Forester'. Three of the most popular turrets are Railgun, Ricochet and Twins. Three of the most popular hulls are Hornet, Viking and Wasp."
    },
    {
        "en": "On New Year's holiday and Tanki's birthday which is celebrated on June 4, the developer team arranges a quest called 'The GAME'. Winners receive a 'dream tank' - a fully micro-upgraded hull, turret and paint. The winner of the event on BD TO 2014 was player KomZorg, who chose Hunter M3 Ricochet M3 and Picasso. Player SteelShark, who was winner of  'The GAME' on NY 2014-2015, received Hornet M3 Hammer M3 and Picasso. Player alex7668-rak, who was the winner of the event on BD TO 2015, received Hunter M3, Smoky M3 and Nano. Player DisappearedStar, who was the winner of the event on NY 2015-2016, chose three paints instead of a 'dream tank': Taiga, Raccoon and Jade."
    },
    {
        "en": "The official VKontakte group of Tanki Online appeared in January 2011. Russian community manager Maksim Khusainov promised to take a dip in the hole if the number of subscribers in the group will be over 500 000. September 27, 2014, this mark has been passed, and on New Year Maksim fulfilled his promise - in the first v-log in 2015 he began speaking from the hole."
    },
    {
        "en": "The game has a total of six maps with an even number of points in Control Points mode - Courage, Deck 9, Magadan, Siege, Factory and Fort Knox. There are four maps - Canyon, Duel, Ping Pong and Hill - which do not contain a Control Points mode at all. In addition, Duel is the only map that is not available to be played in both Capture The Flag and Control Points modes."
    },
    {
        "en": "The most capacious map is Dusseldorf, holding a massive 40 players, Berlin goes next with 36 players max, while Lost Temple and Madness have 32 players max. In turn, Lost Temple is the largest map, Berlin is just a little bit behind, and Dusseldorf closes the top three. The smallest maps are Island, Duel and Ping Pong."
    },
    {
        "en": "In the summer of 2014 the Football World Cup was held in Brazil, and Tanki could not stay away from the event. In the action called 'Football Frenzy' players could purchase one of the 32 paints, symbolizing the participants of the World Cup. Those who bought the paint for winner of the championship were given back a 50% of the crystals spent on purchases during the promotion. Total number of paints bought is 555,502, including for Russia - 111 000 (the most popular paint), for Germany (the winner) - 38 007, for Argentina - 17 641, for the Netherlands - 15 465. The least bought paint was the paint for Côte d'Ivoire - only about 1,000. About 887 million crystals were returned to tankers."
    },
    {
        "en": "In 'The GAME' of May 2013, the prize for those who successfully solved all of the puzzles was a temporary paint called 'Storm' with 15% protection from all turrets. At the end of the quest, 9636 tankers got the paint."
    },
    {
        "en": "A long time ago Railgun was called Fear Machine, Ricochet could've been called Vulcan, Hornet could've been called Raptor, Viking could've been called Centurion, and Hammer could've been called Magnum. As for the Vulcan, the game designer Semyon Strizhak (known as Hazel-Rah) jokingly promised that 'the turret will never be named Vulcan, otherwise I grow two additional fingers on the hand.'"
    },
    {
        "en": "Spectator mode wasn't in the game from the beginning. The first clan war broadcasted using spectator mode was the quarter-final of the upper bracket of TOF Dream Team III between the teams 'International' and 'Tyazhelo i Slozhno' (which means 'Difficult and Complicated')."
    },
    {
        "en": "In the summer of 2015, the team of Tanki Online visited the Gamescom game exhibition in Cologne, Germany. In honour of this event, a map named 'Cologne' was introduced, on which Gold boxes worth 2000 crystals fell. During the event, 191 million crystals fell in Gold Boxes and the map was visited by about a million players."
    },
    {
        "en": "In many maps you can find rusted skeletons of Titan + Firebird combination: It is a tribute to the players from pre-rebalance era, according to which Titan + Firebird combination was considered the most absurd and useless combination of turret and hull."
    },
    {
        "en": "Tanki Online's birthday is considered to be June 4, 2009 - the date of the start of the open beta testing. The first player to have reached the highest rank (at the time it was Marshal) was the legendary T7000. In April 2010, a Chinese server was started. On 16 April 2014, Tanki Online was launched in Brazil. First Generalissimo in the Brazilian community was the player limadj2 — he reached 1 400 000 experience points on 2 September 2014, spending about four and a half months to get to the highest rank. As a reward for his speedy passage, limadj2 received a fully micro-upgraded Viking M3, Ricochet M3 and Zeus."
    },
    {
        "en": "Sometimes in holidays and special celebrations, funds in the game are increased. The biggest funds in the game were five times the normal fund on August 2, 2015 in honour of the 50 000 viewers who tuned it to watch the eSports finals on Tanki Online's Twitch channel."
    },
    {
        "en": "On May 9, 2015 there was a pass 'Endless Supplies', which costed 70 and could be bought until a restart on May 10th. On that day it was almost impossible to find a player who was playing without three supplies activated at once - except for those who played in PRO-battles with supplies disabled."
    },
    {
        "en": "During the Christmas holidays 2014-2015, an entrance from North Korea was registered in Tanki Online. It's known that access to the Internet is severely limited in North Korea. Who could it be?"
    },
    {
        "en": "During the Christmas holidays 2014-2015, there was a special promotion in which you could hire unique XT versions of Railgun and Hornet and a special paint, Frost - which had 20% protection from all turrets. Railgun XT and Hornet XT had a 50% boost over normal Railgun and Hornet. The special items were in the game for twelve days and you could hire these at any time during the twelve days. The price started at 150 000 crystals for Railgun XT M0 and an additional 50 000 for each modification, which gave you the item in your garage for the whole twelve days. Each day after, the prices were reduced by approximately 30%."
    },
    {
        "en": "Deathmatch (DM) is the most popular game mode, amounting to 42% of all battles created. It is followed by Capture the Flag (CTF) with 33%, Team Deathmatch (TDM) with 14% and Control Points (CP) with 11%."
    },
    {
        "en": "Forester is the most popular of all the paints. In December 2015, the paint was used in battles for a total of 1 258 208 hours. That is equal to 137 years!"
    },
    {
        "en": "Sandbox is the most popular map in Tanki Online. In 2015 alone, players created a whopping 7.7 Million Sandbox battles."
    },
    {
        "en": "Not everybody knows about the special Moonwalker paint. It was added to the game during the Farewell to Moon Silence map event, and was available for purchase until its very end. The map doesn't exist in the game any more, but the paint does."
    },
    {
        "en": "If two discounts are applied to an item, they don't add up. Here is how it works: The first discount is applied to the item, and then the second discount is applied to the already discounted price. For example, a 20% personal discount and a 25% sale from a promotion would give you a total of 40% off, not 45%."
    },
    {
        "en": "Active supply indicators on top of other players' tanks were only added into the game half a year after supplies were launched. Before that, you had to guess whether an enemy had Double Attack/Double Armor activated."
    },
    {
        "en": "Nauru, Kiribati and Guinea-Bissau are the three countries with the smallest player population. In fact, there is only one tanker living in each of these three countries according to statistics."
    },
    {
        "en": "Mammoth could have had a different name. While the heavy hull was still in development, the name 'Goliath' was seriously being considered by the developers."
    },
    {
        "en": "Not all Generalissimos were Field Marshals and Commanders before reaching their rank. Before the 17th of December 2012, the highest rank in the game was Marshal. When the new ranks were added, many Marshals had more than 1 400 000 experience points."
    },
    {
        "en": "petraz was the first tanker who managed to get on top of Rio's skyscraper. He did it on the 1st of April 2014, during the event for the launch of Tanki Online in Brazil."
    },
    {
        "en": "There are several phrases written in Persian in the map «Iran». The one on the blue flag in the center of the map says 'We've been through a lot to reach the peak of the mountains'. The small writing on the houses can be translated as 'We live not for ourselves, but for the greater good', while the sign on the gate simply says 'Welcome'."
    },
    {
        "en": "The Daily Mission that is completed most often in the game is 'Finish First in Battle'. It is followed by 'Collect Repair Kits' and then by 'Collect Speed Boosts'."
    },
    {
        "en": "The total amount of crystals earned as rank-up rewards from Recruit all the way to Legend is 354 010. Almost half of those are earned from the last 5 ranks."
    }
]